{
  "\n": 17,
  " ": 14,
  "!": 118,
  "\"": 30,
  "'": 28,
  "(": 166,
  ")": 154,
  "*": 22,
  ",": 16,
  "-": 41,
  ".": 15,
  "0": 4,
  "1": 5,
  "2": 6,
  "3": 7,
  "4": 8,
  "5": 9,
  "6": 10,
  "7": 11,
  "8": 12,
  "9": 13,
  ":": 48,
  "?": 128,
  "[BOS]": 2,
  "[EOS]": 3,
  "[PAD]": 0,
  "[UNK]": 1,
  "an": 27,
  "ba": 303,
  "bi": 338,
  "biến": 222,
  "biết": 90,
  "biệt": 331,
  "buông": 247,
  "bà": 149,
  "bãi": 248,
  "bên": 250,
  "bạch": 162,
  "bất": 71,
  "bậc": 38,
  "bằng": 202,
  "bị": 298,
  "bọt": 349,
  "bốc": 273,
  "bởi": 293,
  "cho": 150,
  "chào": 188,
  "chán": 173,
  "chánh": 332,
  "chính": 95,
  "chóng": 98,
  "chạm": 116,
  "chảo": 206,
  "chậm": 337,
  "chớ": 315,
  "co": 178,
  "các": 19,
  "cách": 110,
  "cái": 224,
  "cánh": 200,
  "cây": 350,
  "có": 141,
  "cúi": 227,
  "căn": 29,
  "cũng": 102,
  "cả": 63,
  "cảm": 44,
  "cần": 243,
  "cầu": 290,
  "của": 50,
  "cứ": 172,
  "diệt": 83,
  "do": 70,
  "duyên": 208,
  "duỗi": 184,
  "dàng": 117,
  "dành": 231,
  "dạy": 87,
  "dễ": 121,
  "ghi": 262,
  "ghê": 316,
  "giác": 325,
  "giáo": 252,
  "giả": 125,
  "giảng": 78,
  "giọt": 164,
  "giống": 153,
  "giới": 59,
  "gom": 288,
  "gotama": 185,
  "gì": 341,
  "gảy": 352,
  "gầm": 261,
  "gọi": 91,
  "gốc": 280,
  "hai": 80,
  "hay": 194,
  "hoan": 295,
  "hoàn": 339,
  "hành": 137,
  "hãy": 163,
  "hơi": 204,
  "hơn": 213,
  "hương": 148,
  "hạnh": 221,
  "hẳn": 305,
  "học": 158,
  "hỏi": 145,
  "hối": 346,
  "hữu": 165,
  "hỷ": 259,
  "im": 263,
  "kajaṅgalā": 285,
  "kheo": 73,
  "khi": 36,
  "khu": 276,
  "khác": 313,
  "khéo": 264,
  "không": 53,
  "khả": 40,
  "khắc": 244,
  "khỏe": 175,
  "khởi": 82,
  "kia": 176,
  "kinh": 192,
  "kính": 319,
  "la": 142,
  "liền": 72,
  "lung": 343,
  "luật": 61,
  "ly": 57,
  "là": 18,
  "làm": 196,
  "lá": 342,
  "lên": 75,
  "lòng": 296,
  "lưỡi": 115,
  "lưỡng": 253,
  "lại": 89,
  "lập": 266,
  "lắng": 214,
  "lặng": 238,
  "lẹ": 97,
  "lẽ": 297,
  "lễ": 218,
  "lời": 86,
  "lực": 229,
  "mau": 106,
  "mn": 215,
  "mong": 127,
  "muốn": 114,
  "mà": 317,
  "mãn": 143,
  "móng": 236,
  "môn": 138,
  "mù": 186,
  "mùi": 314,
  "mũi": 133,
  "mưu": 271,
  "mạnh": 174,
  "mất": 344,
  "mẫn": 301,
  "mắt": 76,
  "mặt": 327,
  "mọc": 245,
  "một": 42,
  "mới": 55,
  "mở": 191,
  "nay": 205,
  "ngay": 348,
  "nghe": 74,
  "nghiêng": 321,
  "ngài": 201,
  "ngày": 254,
  "người": 64,
  "ngồi": 197,
  "ngửi": 156,
  "nhanh": 81,
  "nhàm": 251,
  "nhàng": 323,
  "như": 25,
  "nhưng": 85,
  "nhận": 77,
  "nhắm": 199,
  "nhẹ": 269,
  "nhỏ": 292,
  "nhổ": 336,
  "những": 84,
  "niên": 159,
  "niệm": 318,
  "nung": 311,
  "nào": 140,
  "này": 65,
  "nên": 232,
  "nói": 207,
  "nóng": 312,
  "nước": 130,
  "nản": 233,
  "nếm": 151,
  "nếu": 94,
  "nữa": 122,
  "pháp": 23,
  "phát": 195,
  "phúc": 302,
  "phải": 193,
  "phật": 289,
  "phụng": 228,
  "pārāsariya": 120,
  "qua": 347,
  "ra": 171,
  "ran": 225,
  "rũ": 283,
  "rơi": 183,
  "rồi": 161,
  "rừng": 246,
  "rực": 299,
  "sao": 123,
  "sau": 134,
  "sen": 219,
  "sinh": 131,
  "suốt": 351,
  "sáng": 275,
  "sùng": 277,
  "sư": 284,
  "sượng": 281,
  "sắc": 107,
  "sắt": 267,
  "sẽ": 68,
  "sợ": 249,
  "sự": 79,
  "ta": 54,
  "tai": 113,
  "tay": 155,
  "thanh": 139,
  "theo": 340,
  "thiền": 210,
  "thiện": 274,
  "thuyết": 203,
  "thánh": 52,
  "thân": 124,
  "thì": 180,
  "thô": 182,
  "thù": 96,
  "thăm": 212,
  "thưa": 157,
  "thương": 241,
  "thượng": 60,
  "thất": 209,
  "thấy": 108,
  "thắng": 112,
  "thế": 47,
  "thệ": 235,
  "thọ": 34,
  "thốt": 330,
  "thời": 167,
  "thức": 152,
  "thực": 160,
  "tinh": 326,
  "tiếc": 257,
  "tiếng": 119,
  "toàn": 278,
  "toẹt": 240,
  "tre": 282,
  "tri": 100,
  "trong": 35,
  "tránh": 279,
  "trên": 190,
  "trôi": 334,
  "trú": 26,
  "trược": 198,
  "trừ": 187,
  "tu": 31,
  "tuy": 307,
  "tuệ": 109,
  "tuột": 335,
  "tác": 322,
  "tâm": 45,
  "tình": 265,
  "tín": 333,
  "tôi": 242,
  "tôn": 46,
  "tĩnh": 105,
  "tưởng": 129,
  "tại": 270,
  "tấn": 345,
  "tận": 101,
  "tập": 33,
  "tỉnh": 300,
  "tịch": 99,
  "tịnh": 329,
  "tốc": 104,
  "tởm": 308,
  "tức": 324,
  "tử": 144,
  "tựa": 168,
  "tỳ": 69,
  "uttara": 132,
  "vai": 220,
  "viên": 136,
  "và": 21,
  "vâng": 310,
  "vì": 306,
  "vô": 62,
  "vạm": 328,
  "vấn": 320,
  "vầy": 237,
  "vậy": 43,
  "vắng": 304,
  "vẻ": 309,
  "về": 147,
  "vị": 24,
  "với": 49,
  "vỡ": 211,
  "vừa": 103,
  "xa": 260,
  "xin": 294,
  "xong": 255,
  "xuống": 291,
  "xèo": 230,
  "xúc": 146,
  "xả": 37,
  "y": 179,
  "yểm": 58,
  "ái": 39,
  "âm": 272,
  "ông": 169,
  "ý": 92,
  "ānanda": 67,
  "đang": 126,
  "đi": 189,
  "điếc": 177,
  "điều": 256,
  "đáp": 239,
  "đây": 32,
  "đã": 51,
  "đó": 56,
  "đôi": 286,
  "đúng": 170,
  "được": 93,
  "đạo": 217,
  "đảnh": 234,
  "đầu": 287,
  "đến": 216,
  "đều": 181,
  "để": 88,
  "đệ": 135,
  "định": 223,
  "đọng": 226,
  "đối": 66,
  "độ": 111,
  "đừng": 258,
  "ấy": 20,
  "ở": 268
}