{
  "\n": 5,
  " ": 4,
  "!": 39,
  "\"": 10,
  "#": 20,
  "%": 312,
  "&": 35,
  "(": 9,
  ")": 8,
  "*": 11,
  "+": 62,
  ",": 13,
  "-": 16,
  ".": 6,
  "/": 15,
  "0": 135,
  "000": 362,
  "1": 32,
  "100": 361,
  "2": 51,
  "3": 67,
  "30": 346,
  "4": 188,
  "5": 145,
  ":": 7,
  ";": 14,
  "<": 60,
  "=": 17,
  ">": 43,
  "?": 30,
  "[": 19,
  "[BOS]": 2,
  "[EOS]": 3,
  "[PAD]": 0,
  "[UNK]": 1,
  "\\n": 68,
  "\\s": 98,
  "\\w": 66,
  "]": 18,
  "^": 189,
  "_count": 345,
  "`": 12,
  "a": 122,
  "an": 366,
  "and_then": 249,
  "as_bytes": 256,
  "b": 155,
  "ban": 199,
  "bao": 154,
  "biến": 236,
  "biết": 352,
  "biệt": 374,
  "bos": 130,
  "bos_token": 227,
  "build": 244,
  "báo": 253,
  "bù": 232,
  "bạn": 25,
  "bản": 202,
  "bắt": 372,
  "bổ": 353,
  "bộ": 183,
  "cap": 184,
  "captures_iter": 190,
  "cargo": 229,
  "cho": 178,
  "chuẩn": 100,
  "chào": 231,
  "chính": 143,
  "chưa": 115,
  "chương": 99,
  "chạy": 186,
  "chất": 254,
  "chế": 325,
  "chỉ": 114,
  "chọn": 225,
  "chứa": 344,
  "chữ": 318,
  "clone": 377,
  "cmp": 354,
  "code": 110,
  "collect": 297,
  "collections": 339,
  "content": 107,
  "create": 328,
  "current_id": 91,
  "các": 71,
  "cách": 108,
  "cái": 176,
  "câu": 159,
  "còn": 223,
  "có": 48,
  "công": 169,
  "cả": 338,
  "cấu": 109,
  "cầu": 326,
  "của": 170,
  "cực": 150,
  "data": 92,
  "data_dir": 79,
  "do": 288,
  "dung": 211,
  "dòng": 149,
  "dùng": 72,
  "dấu": 40,
  "dần": 320,
  "dễ": 294,
  "dụ": 138,
  "dữ": 45,
  "e": 151,
  "entry": 112,
  "enumerate": 204,
  "eos": 173,
  "eos_token": 238,
  "extension": 234,
  "face": 321,
  "file": 29,
  "filter_map": 281,
  "fn": 295,
  "folder": 65,
  "for": 74,
  "forge": 349,
  "fs": 319,
  "gb": 116,
  "giúp": 76,
  "giải": 226,
  "giảm": 301,
  "giới": 330,
  "giữ": 260,
  "góp": 248,
  "gốc": 205,
  "gồm": 141,
  "gợi": 334,
  "hashmap": 47,
  "hiện": 187,
  "hiệu": 261,
  "hoàn": 300,
  "hoặc": 250,
  "hugging": 340,
  "huy": 165,
  "hàng": 53,
  "hãy": 191,
  "hình": 222,
  "hơn": 182,
  "hướng": 203,
  "hạn": 207,
  "học": 129,
  "hồi": 193,
  "i": 164,
  "if": 310,
  "in": 73,
  "insert": 119,
  "into_iter": 240,
  "io": 139,
  "is_file": 315,
  "iter": 140,
  "json": 33,
  "json_vocab": 181,
  "khi": 86,
  "khoảng": 282,
  "khôn": 347,
  "không": 105,
  "kia": 200,
  "ký": 365,
  "kết": 192,
  "kỳ": 212,
  "kỹ": 273,
  "len": 180,
  "let": 24,
  "liệu": 55,
  "lm": 177,
  "load": 194,
  "logic": 299,
  "lossless": 206,
  "là": 52,
  "làm": 276,
  "lên": 174,
  "lò": 208,
  "lý": 95,
  "lạ": 263,
  "lại": 201,
  "lấy": 134,
  "lần": 277,
  "lọc": 88,
  "lỗi": 289,
  "lớn": 271,
  "lựa": 233,
  "main": 131,
  "metadata": 298,
  "model": 69,
  "mut": 37,
  "muốn": 54,
  "mà": 255,
  "mã": 218,
  "mô": 348,
  "mắc": 378,
  "một": 41,
  "mở": 341,
  "new": 46,
  "nghiệp": 368,
  "nghìn": 327,
  "nguồn": 332,
  "ngầu": 351,
  "nhanh": 168,
  "nhiễu": 314,
  "như": 258,
  "nhưng": 279,
  "nhất": 171,
  "nhẹ": 237,
  "nhớ": 245,
  "những": 161,
  "nào": 120,
  "này": 28,
  "nên": 148,
  "nó": 42,
  "nói": 287,
  "nếu": 44,
  "nội": 269,
  "nữa": 215,
  "ok": 124,
  "open": 364,
  "or_insert": 286,
  "output_file": 113,
  "pad": 175,
  "pad_token": 270,
  "padding": 247,
  "paragraph": 228,
  "path": 34,
  "pattern": 305,
  "phải": 316,
  "phần": 290,
  "phổ": 272,
  "phục": 371,
  "println": 82,
  "pro": 268,
  "project": 324,
  "pruning": 359,
  "quan": 125,
  "quy": 214,
  "quét": 93,
  "quả": 196,
  "r": 264,
  "ra": 307,
  "re": 128,
  "read": 220,
  "read_to_string": 331,
  "regex": 49,
  "result": 309,
  "riêng": 156,
  "rs": 303,
  "rust": 56,
  "rác": 356,
  "rèn": 317,
  "rưởi": 242,
  "rất": 157,
  "rộng": 278,
  "s": 160,
  "sau": 64,
  "self": 142,
  "serde": 219,
  "serde_json": 87,
  "size": 329,
  "small": 123,
  "some": 285,
  "sort_by": 217,
  "sorted_counts": 85,
  "special": 283,
  "special_tokens": 106,
  "src": 198,
  "std": 57,
  "string": 75,
  "sung": 363,
  "suất": 101,
  "syllable": 342,
  "sắp": 265,
  "sẽ": 59,
  "sống": 239,
  "theo": 152,
  "thuật": 274,
  "thành": 313,
  "thêm": 50,
  "thì": 343,
  "thông": 373,
  "thúc": 259,
  "thư": 179,
  "thắc": 308,
  "thể": 163,
  "thủ": 333,
  "thứ": 280,
  "thực": 336,
  "tin": 369,
  "tiếng": 335,
  "tiết": 146,
  "to_str": 262,
  "to_string": 167,
  "to_string_pretty": 304,
  "token": 27,
  "tokenize": 379,
  "tokenizer": 296,
  "tokenizer_config": 370,
  "tokens": 137,
  "toml": 358,
  "top": 235,
  "toàn": 380,
  "trong": 70,
  "trên": 83,
  "trình": 96,
  "trúc": 153,
  "trăm": 209,
  "trước": 291,
  "trắng": 216,
  "trọng": 81,
  "txt": 252,
  "tác": 292,
  "tách": 136,
  "tâm": 267,
  "tên": 166,
  "tính": 337,
  "tôi": 63,
  "tạo": 104,
  "tả": 230,
  "tất": 357,
  "tần": 90,
  "tới": 117,
  "từ": 38,
  "tự": 221,
  "u": 375,
  "unicode": 224,
  "unk": 126,
  "unk_token": 322,
  "unwrap": 376,
  "use": 36,
  "usize": 89,
  "vec": 162,
  "vinasyllableforge": 210,
  "viết": 213,
  "việc": 121,
  "viện": 185,
  "việt": 133,
  "vocab": 22,
  "và": 84,
  "vài": 127,
  "vào": 158,
  "vì": 311,
  "ví": 132,
  "văn": 97,
  "về": 197,
  "vị": 246,
  "với": 257,
  "vừa": 144,
  "walkdir": 77,
  "word_counts": 80,
  "write": 360,
  "write_all": 350,
  "xuất": 58,
  "xuống": 61,
  "xác": 241,
  "xếp": 323,
  "xử": 94,
  "yêu": 284,
  "{": 21,
  "|": 31,
  "}": 23,
  "âm": 147,
  "ý": 293,
  "đang": 103,
  "điều": 78,
  "đoạn": 172,
  "đáp": 355,
  "đã": 102,
  "đúng": 111,
  "đơn": 266,
  "được": 275,
  "đấy": 243,
  "đầu": 195,
  "đặc": 306,
  "đếm": 367,
  "đề": 251,
  "để": 26,
  "định": 302,
  "đủ": 118
}