{
  "\n": 5,
  " ": 4,
  "!": 39,
  "\"": 10,
  "#": 20,
  "%": 262,
  "&": 37,
  "(": 8,
  ")": 9,
  "*": 12,
  "+": 75,
  ",": 14,
  "-": 17,
  ".": 6,
  "/": 16,
  "0": 193,
  "000": 317,
  "1": 33,
  "100": 340,
  "2": 47,
  "3": 74,
  "30": 226,
  "4": 132,
  "5": 168,
  ":": 7,
  ";": 15,
  "<": 73,
  "=": 18,
  ">": 56,
  "?": 31,
  "[": 23,
  "[BOS]": 2,
  "[EOS]": 3,
  "[PAD]": 0,
  "[UNK]": 1,
  "\\n": 82,
  "\\s": 119,
  "\\w": 72,
  "]": 22,
  "^": 179,
  "_": 11,
  "`": 13,
  "a": 189,
  "all": 294,
  "an": 376,
  "and": 348,
  "as": 306,
  "b": 167,
  "ban": 341,
  "bao": 175,
  "biến": 297,
  "biết": 273,
  "biệt": 321,
  "bos": 118,
  "build": 229,
  "by": 290,
  "bytes": 269,
  "báo": 377,
  "bù": 285,
  "bạn": 30,
  "bản": 206,
  "bắt": 266,
  "bổ": 251,
  "bộ": 166,
  "cap": 145,
  "captures": 286,
  "cargo": 242,
  "cho": 171,
  "chuẩn": 98,
  "chào": 276,
  "chính": 139,
  "chưa": 170,
  "chương": 110,
  "chạy": 142,
  "chất": 219,
  "chế": 292,
  "chỉ": 101,
  "chọn": 258,
  "chứa": 336,
  "chữ": 239,
  "clone": 365,
  "cmp": 293,
  "code": 112,
  "collect": 334,
  "collections": 232,
  "config": 327,
  "content": 89,
  "count": 199,
  "counts": 42,
  "create": 342,
  "current": 114,
  "các": 71,
  "cách": 109,
  "cái": 156,
  "câu": 163,
  "còn": 320,
  "có": 48,
  "công": 183,
  "cả": 254,
  "cấu": 120,
  "cầu": 208,
  "của": 133,
  "cực": 191,
  "data": 45,
  "dir": 117,
  "do": 343,
  "dung": 344,
  "dòng": 187,
  "dùng": 63,
  "dấu": 43,
  "dần": 263,
  "dễ": 378,
  "dụ": 130,
  "dữ": 55,
  "e": 134,
  "entry": 113,
  "enumerate": 209,
  "eos": 106,
  "extension": 322,
  "face": 313,
  "file": 25,
  "filter": 246,
  "fn": 221,
  "folder": 79,
  "for": 64,
  "forge": 224,
  "fs": 326,
  "gb": 180,
  "giúp": 76,
  "giải": 303,
  "giảm": 374,
  "giới": 253,
  "giữ": 203,
  "góp": 234,
  "gốc": 211,
  "gồm": 188,
  "gợi": 197,
  "hashmap": 54,
  "hiện": 161,
  "hiệu": 256,
  "hoàn": 360,
  "hoặc": 296,
  "hugging": 277,
  "huy": 154,
  "hàng": 52,
  "hãy": 260,
  "hình": 299,
  "hơn": 136,
  "hướng": 352,
  "hạn": 319,
  "học": 164,
  "hồi": 307,
  "i": 141,
  "id": 103,
  "if": 205,
  "in": 67,
  "insert": 111,
  "into": 345,
  "io": 192,
  "is": 237,
  "iter": 85,
  "json": 24,
  "khi": 104,
  "khoảng": 315,
  "khôn": 364,
  "không": 90,
  "kia": 361,
  "ký": 248,
  "kết": 362,
  "kỳ": 228,
  "kỹ": 270,
  "len": 157,
  "let": 26,
  "liệu": 59,
  "lm": 178,
  "load": 333,
  "logic": 335,
  "lossless": 201,
  "là": 51,
  "làm": 284,
  "lên": 126,
  "lò": 359,
  "lý": 91,
  "lạ": 357,
  "lại": 355,
  "lấy": 190,
  "lần": 274,
  "lọc": 125,
  "lỗi": 287,
  "lớn": 213,
  "lựa": 281,
  "main": 153,
  "map": 330,
  "metadata": 280,
  "model": 68,
  "mut": 38,
  "muốn": 60,
  "mà": 298,
  "mã": 338,
  "mô": 288,
  "mắc": 204,
  "một": 44,
  "mở": 301,
  "new": 53,
  "nghiệp": 375,
  "nghìn": 214,
  "nguồn": 245,
  "ngầu": 349,
  "nhanh": 147,
  "nhiễu": 200,
  "như": 202,
  "nhưng": 312,
  "nhất": 169,
  "nhẹ": 255,
  "nhớ": 259,
  "những": 149,
  "nào": 172,
  "này": 32,
  "nên": 128,
  "nó": 49,
  "nói": 369,
  "nếu": 61,
  "nội": 244,
  "nữa": 272,
  "ok": 176,
  "open": 325,
  "or": 233,
  "output": 121,
  "pad": 94,
  "padding": 223,
  "paragraph": 267,
  "path": 35,
  "pattern": 310,
  "phải": 261,
  "phần": 275,
  "phổ": 318,
  "phục": 231,
  "pretty": 240,
  "println": 107,
  "pro": 356,
  "project": 236,
  "pruning": 243,
  "quan": 184,
  "quy": 268,
  "quét": 96,
  "quả": 225,
  "r": 371,
  "ra": 222,
  "re": 160,
  "read": 159,
  "regex": 50,
  "result": 339,
  "riêng": 129,
  "rs": 363,
  "rust": 46,
  "rác": 346,
  "rèn": 283,
  "rưởi": 323,
  "rất": 140,
  "rộng": 220,
  "s": 143,
  "sau": 69,
  "self": 177,
  "serde": 78,
  "size": 332,
  "small": 165,
  "some": 198,
  "sort": 271,
  "sorted": 108,
  "special": 77,
  "src": 247,
  "std": 84,
  "str": 238,
  "string": 36,
  "sung": 252,
  "suất": 86,
  "syllable": 308,
  "sắp": 329,
  "sẽ": 65,
  "sống": 304,
  "then": 328,
  "theo": 146,
  "thuật": 358,
  "thành": 249,
  "thêm": 58,
  "thì": 309,
  "thông": 257,
  "thúc": 218,
  "thư": 162,
  "thắc": 282,
  "thể": 152,
  "thủ": 373,
  "thứ": 353,
  "thực": 195,
  "tin": 337,
  "tiếng": 311,
  "tiết": 127,
  "to": 57,
  "token": 19,
  "tokenize": 279,
  "tokenizer": 137,
  "tokens": 62,
  "toml": 278,
  "top": 368,
  "toàn": 314,
  "trong": 83,
  "trên": 97,
  "trình": 122,
  "trúc": 150,
  "trăm": 367,
  "trước": 354,
  "trắng": 302,
  "trọng": 116,
  "txt": 217,
  "tác": 300,
  "tách": 148,
  "tâm": 324,
  "tên": 151,
  "tính": 351,
  "tôi": 81,
  "tạo": 100,
  "tả": 350,
  "tất": 347,
  "tần": 87,
  "tới": 194,
  "từ": 41,
  "tự": 291,
  "u": 212,
  "unicode": 215,
  "unk": 102,
  "unwrap": 250,
  "use": 40,
  "usize": 124,
  "vec": 185,
  "vinasyllableforge": 372,
  "viết": 331,
  "việc": 181,
  "viện": 155,
  "việt": 158,
  "vocab": 21,
  "và": 88,
  "vài": 186,
  "vào": 144,
  "vì": 289,
  "ví": 138,
  "văn": 93,
  "về": 295,
  "vị": 196,
  "với": 265,
  "vừa": 182,
  "walkdir": 80,
  "word": 99,
  "write": 131,
  "xuất": 70,
  "xuống": 66,
  "xác": 241,
  "xếp": 216,
  "xử": 92,
  "yêu": 264,
  "{": 28,
  "|": 34,
  "}": 27,
  "âm": 173,
  "ý": 305,
  "đang": 115,
  "điều": 105,
  "đoạn": 174,
  "đáp": 210,
  "đã": 95,
  "đúng": 123,
  "đơn": 235,
  "được": 366,
  "đấy": 379,
  "đầu": 370,
  "đặc": 230,
  "đếm": 227,
  "đề": 316,
  "để": 29,
  "định": 207,
  "đủ": 135
}